# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/boneyard'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'


# -------------------
# -------------------
# SOFTWARE

# -------------------
# Web browsers

cask 'firefox'
cask 'chromium'

# -------------------
# Instant messaging

cask 'discord'
cask 'slack'

# -------------------
# Terminal

# I mostly use this terminal
cask 'kitty'
# Useful sometimes
cask 'tmux'
# Copy and paste on tmux
brew 'reattach-to-user-namespace'

# -------------------
# Text editors

# I mostly use Emacs.
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp", "with-no-titlebar", "with-no-frame-refocus"]

# Sometimes I use neovim.
brew "neovim"

# Sometimes needed unfortunately.
cask "visual-studio-code"


# -------------------
# Misc.

# Cool thingy where you can see your keypresses on screen
cask "keycastr"


# -------------------
# -------------------
# GENERAL PACKAGES



# GNU
brew 'texinfo'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'
brew 'gdb'
brew 'gpatch'
brew 'm4'
brew 'make'
brew 'gpg'

brew 'unzip'
brew 'libzip'

brew 'ripgrep'
brew 'grep'

# Terminal tools

cask 'curl', link: true
brew 'wget'
brew 'git'
brew 'git-lfs'
brew 'httrack'
brew 'fzf'
brew 'tldr'
brew 'howdoi'

# PCRE: Perl-compatible regular expressions, for better searching.
brew 'pcre'
brew 'pcre++'


# LaTeX

brew 'mactex' # LaTeX

# Security and password management

brew 'pass'

# -------------------
# General development packages

brew 'pkg-config'
brew 'cmake'
brew 'glib'
brew 'sqlite'


# Java and Clojure
tap 'clojure/tools'
cask 'liberica-jdk15-full'
brew 'ant'
cask 'temurin'
